src/QuanLyThiDuaLenLopComApp/src/jbiasa/QuanLyThiDuaLenLopComApp.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="QuanLyThiDuaLenLopComApp"
             xmlns:tns="QuanLyThiDuaLenLopComApp" xmlns:ns="http://j2ee.netbeans.org/wsdl/QuanLyThiDuaLenLop/XetLenLop" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://j2ee.netbeans.org/wsdl/QuanLyThiDuaLenLop/XetLenLop" location="../jbiServiceUnits/QuanLyThiDuaLenLop/interface_WSDL/XetLenLop.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:XetLenLopPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="XetLenLopOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="QuanLyThiDuaLenLopComApp"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="QuanLyThiDuaLenLopComApp"/>
            </output>
        </operation>
    </binding>
    <service name="QuanLyThiDuaLenLopComAppService1">
        <port name="XetLenLop" binding="tns:casaBinding1">
            <soap:address location="http://localhost:18001/QuanLyThiDuaLenLopComApp/XetLenLop"/>
        </port>
    </service>
</definitions>

