src/QuanLyThiDuaLenLopComApp/test/TestXetLenLop/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:quan="QuanLyThiDuaLenLopComApp">
  <soapenv:Body>
    <quan:XetLenLopOperation>
      <id_hocsinh>1</id_hocsinh>
      <id_lop>1</id_lop>
      <id_namhoc>1</id_namhoc>
    </quan:XetLenLopOperation>
  </soapenv:Body>
</soapenv:Envelope>